## Anomaly detection

https://github.com/ritvikmath/Time-Series-Analysis/blob/master/Anomaly%20Detection.ipynb

In [2]:
import pandas as pd
df=pd.read_csv('catfish.csv')
df.head()

        Date  Total
0  1986-1-01   9034
1  1986-2-01   9596
2  1986-3-01  10558
3  1986-4-01   9002
4  1986-5-01   9239

In [3]:
from datetime import datetime
df['Date'] = df['Date'].apply(lambda x: datetime.strptime(x, '%Y-%m-%d'))

In [4]:
df.head()

        Date  Total
0 1986-01-01   9034
1 1986-02-01   9596
2 1986-03-01  10558
3 1986-04-01   9002
4 1986-05-01   9239

its a monthly data